{
  "projects": [
    {
      "id": "meshtastic-n8n-ai-bridge",
      "title": "Meshtastic ↔ n8n AI Bridge",
      "description": {
        "it": "Sistema intelligente che trasforma la tua rete Meshtastic LoRa in una rete di comunicazione automatizzata con intelligenza artificiale. Permette di creare bot AI che rispondono automaticamente ai messaggi ricevuti via radio, rendendo i nodi Meshtastic veri e propri assistenti virtuali distribuiti.",
        "en": "Intelligent system that transforms your Meshtastic LoRa network into an automated communication network with artificial intelligence. It allows you to create AI bots that automatically respond to messages received via radio, making Meshtastic nodes true distributed virtual assistants."
      },
      "image": "project1.jpg",
      "imageOptimized": "project1.webp",
      "technologies": ["Python", "Meshtastic", "n8n", "LoRa", "AI", "LLM"],
      "github": "https://github.com/PalermoAlessio/Meshtastic-n8n-AI-Bridge",
      "demo": null
    },
    {
      "id": "stem-solver-adk",
      "title": "STEM Solver ADK",
      "description": {
        "it": "Un Agent Development Kit (ADK) per creare agenti autonomi e specializzati in grado di risolvere problemi STEM complessi. Sfrutta un'architettura modulare e si integra con strumenti come Wolfram Alpha per fornire soluzioni accurate e dettagliate.",
        "en": "An Agent Development Kit (ADK) for creating autonomous, specialized agents capable of solving complex STEM problems. It leverages a modular architecture and integrates with tools like Wolfram Alpha to provide accurate and detailed solutions."
      },
      "image": "project2.jpg",
      "imageOptimized": "project2.webp",
      "technologies": ["Python", "GoogleADK", "LLM", "Agent", "Wolfram Alpha"],
      "github": "https://github.com/VerifyLoop/stem-solver-adk",
      "demo": null
    },
    {
      "id": "mcp-behavioral-prompts",
      "title": "MCP Behavioral Prompts",
      "description": {
        "it": "Server specializzato del Model Context Protocol (MCP) che fornisce prompt comportamentali avanzati per migliorare le capacità di ragionamento e interazione degli assistenti AI. Include template specializzati come Complex Project Analyst per definizioni iterative di progetti, Socratic Strategic Consultant per interrogazioni critiche, Critical Code Reviewer per analisi di codice production-ready e AI Software Architect per pianificazione strutturata del software.",
        "en": "A specialized Model Context Protocol (MCP) server that provides behavioral modification prompts to enhance AI assistants' reasoning and interaction capabilities. Features specialized prompt templates including Complex Project Analyst for iterative project definition, Socratic Strategic Consultant for critical questioning, Critical Code Reviewer for production-ready code analysis, and AI Software Architect for structured software planning."
      },
      "image": "project3.jpg",
      "imageOptimized": "project3.webp",
      "technologies": ["Python", "MCP", "Poetry", "AI Prompts", "Server Architecture"],
      "github": "https://github.com/VerifyLoop/mcp-behavioral-prompts",
      "demo": null
    }
  ]
}