{
  "projects": [
    {
      "id": "meshtastic-n8n-ai-bridge",
      "title": "Meshtastic ↔ n8n AI Bridge",
      "description": {
        "it": "Sistema intelligente che trasforma la tua rete Meshtastic LoRa in una rete di comunicazione automatizzata con intelligenza artificiale. Permette di creare bot AI che rispondono automaticamente ai messaggi ricevuti via radio, rendendo i nodi Meshtastic veri e propri assistenti virtuali distribuiti.",
        "en": "Intelligent system that transforms your Meshtastic LoRa network into an automated communication network with artificial intelligence. It allows you to create AI bots that automatically respond to messages received via radio, making Meshtastic nodes true distributed virtual assistants."
      },
      "image": "project1.jpg",
      "imageOptimized": "project1.webp",
      "technologies": ["Python", "Meshtastic", "n8n", "LoRa", "AI", "LLM"],
      "github": "https://github.com/PalermoAlessio/Meshtastic-n8n-AI-Bridge",
      "demo": null
    },
    {
      "id": "stem-solver-adk",
      "title": "STEM Solver ADK",
      "description": {
        "it": "Un Agent Development Kit (ADK) per creare agenti autonomi e specializzati in grado di risolvere problemi STEM complessi. Sfrutta un'architettura modulare e si integra con strumenti come Wolfram Alpha per fornire soluzioni accurate e dettagliate.",
        "en": "An Agent Development Kit (ADK) for creating autonomous, specialized agents capable of solving complex STEM problems. It leverages a modular architecture and integrates with tools like Wolfram Alpha to provide accurate and detailed solutions."
      },
      "image": "project2.jpg",
      "imageOptimized": "project2.webp",
      "technologies": ["Python", "GoogleADK", "LLM", "Agent", "Wolfram Alpha"],
      "github": "https://github.com/VerifyLoop/stem-solver-adk",
      "demo": null
    },
    {
      "id": "tts-chrome-extension",
      "title": "TTS Chrome Extension",
      "description": {
        "it": "Un'estensione per Chrome leggera e potente che converte il testo selezionato in parlato utilizzando il modello TTS di Google Gemini 2.5 Flash. È dotata di una barra di controllo mobile e trascinabile per gestire la riproduzione audio (play/pausa, salto, controllo della velocità). Gli utenti possono attivarla facendo clic con il pulsante destro del mouse sul testo selezionato o utilizzando una scorciatoia da tastiera. L'estensione è costruita utilizzando il moderno standard Manifest V3 per le estensioni di Chrome.",
        "en": "A lightweight and powerful Chrome extension that converts selected text into speech using Google's Gemini 2.5 Flash TTS model. It features a floating, draggable control bar to manage audio playback (play/pause, skip, speed control). Users can activate it by right-clicking selected text or using a keyboard shortcut. The extension is built using the modern Manifest V3 standard for Chrome extensions."
      },
      "image": "project3.jpg",
      "imageOptimized": "project3.webp",
      "technologies": ["JavaScript", "HTML", "CSS", "Chrome Extension", "Gemini API"],
      "github": "https://github.com/PalermoAlessio/tts-chrome-extension",
      "demo": null
    }
  ]
}